blog/purescript-jp.org
#+TITLE: ServantとPurescript/Halogenでウェブ開発
#+DATE: 2018-02-21
#+AUTHOR: Colin
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>

* Haskell

ウェブ・サーバーを開発する時はやっぱり[[http://haskell-servant.readthedocs.io/en/stable/][Servant]]。俺の経験では、どの言語のどのフレームワークでも
開発効率が一番高い。幸い、Purescriptとの統合も容易。

このガイドを使うに前もって必要なのは「stack」と「Servant」の経験。

** プロジェクト設定

後でPurescriptとのコードシェアがうまくいく様にbackendを三つに分けることを勧める。
それぞれの部分にはちゃんと ~.cabal~ または ~package.yaml~ を与える。
stack設定はこう：

#+BEGIN_SRC yaml
  resolver: lts-10.6  # ２０１８年2月現在

  packages:
    - lib      # Purescriptとシェアしたい全て。ServantのAPIタイプも含めて！
    - server   # Backendの本格的コード。
    - bridge   # `lib`を使ってPurescriptを生み出してくれるコード。

  extra-deps:
    - servant-0.12.1
    - servant-server-0.12
    - servant-foreign-0.10.2
#+END_SRC

** Purescriptとのコードシェア

二つのlibrariesが助けてくれる：

- ~purescript-bridge~: 指摘したHaskellタイプと一致するPurescriptを生み出す。
- ~servant-purescript~: BackendのJSON endpointsが問えるPurescriptを生み出す。

どうやら ~servant-purescript~ はJSON endpointsでしか使えん様で、本サイトの ~Common~
module にはこういうのがある：

#+BEGIN_SRC haskell
  type JsonAPI = "posts" :> Get '[JSON] [Blog]

  type API = JsonAPI
    :<|> "blog" :> Capture "post" Text :> Get '[HTML] (Html ())
    :<|> "assets" :> Raw
    :<|> "webfonts" :> Raw
    :<|> Get '[HTML] (Html ())
#+END_SRC

Purescriptとシェアしたいのは ~JsonAPI~ だけ。で、 ~bridge~ のプログラムには：

#+BEGIN_SRC haskell
  {-# LANGUAGE DataKinds, FlexibleContexts #-}

  module Main where

  import Common (Blog, JsonAPI)
  import Language.PureScript.Bridge
  import Servant.PureScript
  import Time.Types

  -- | Purescriptにしたい自分のHaskellタイプ。新しいPurescriptが出る。
  types :: [SumType 'Haskell]
  types = [ mkSumType (Proxy :: Proxy Blog) ]

  -- | 自作「bridge」。形の全く同じHaskellとPurescriptのタイプを繋げたいと意味する。
  -- 新しいコードは出ない。ただJSON decodingの際にだけ使われる。
  monthBridge :: BridgePart
  monthBridge = typeName ^== "Month" >> pure psMonth

  psMonth :: PSType
  psMonth = TypeInfo { _typePackage    = "purescript-datetime"
                     , _typeModule     = "Data.Date"
                     , _typeName       = "Month"
                     , _typeParameters = [] }

  main :: IO ()
  main = do
    writePSTypes "site/src" (buildBridge $ defaultBridge <|> monthBridge) types
    writeAPIModule "site/src" defaultBridgeProxy (Proxy :: Proxy JsonAPI)
#+END_SRC

~stack exec -- bridge~ を使ってみると、 ~site/src~ に新しいPurescriptコードが現れる。
下記の「Halogen」の所にこのコードをどう使うかは説明される。

