blog/purescript-jp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-23 Fri 08:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ServantとPurescript/Halogenでウェブ開発</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ServantとPurescript/Halogenでウェブ開発</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge517c7e">1. Haskell</a>
<ul>
<li><a href="#org060d06e">1.1. プロジェクト設定</a></li>
<li><a href="#orgdef4f29">1.2. Purescriptとのコードシェア</a></li>
<li><a href="#orgec28b74">1.3. Assetsの提供</a>
<ul>
<li><a href="#orgdf30af4">1.3.1. 自動圧縮</a></li>
</ul>
</li>
<li><a href="#org267d43a">1.4. 無HTML</a></li>
</ul>
</li>
<li><a href="#org70f1af4">2. Purescript</a>
<ul>
<li><a href="#org342599c">2.1. 最初の設定</a>
<ul>
<li><a href="#org00cfae1">2.1.1. ツール</a></li>
<li><a href="#org696a852">2.1.2. Purescriptパッケージ</a></li>
<li><a href="#orgbfa8b9e">2.1.3. Spacemacsでの使用</a></li>
</ul>
</li>
<li><a href="#org3f27c2c">2.2. 便利なコマンド</a></li>
<li><a href="#org5764b62">2.3. Halogen</a>
<ul>
<li><a href="#org64c95b7">2.3.1. 無駄なレンダリングの回避</a></li>
<li><a href="#org76cba73">2.3.2. <code>servant-purescript</code> が出したタイプや関数の扱い</a></li>
<li><a href="#org15cddac">2.3.3. Effectのあるコンポーネント発動</a></li>
<li><a href="#orga245af1">2.3.4. HTMLの要求と注入</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge517c7e" class="outline-2">
<h2 id="orge517c7e"><span class="section-number-2">1</span> Haskell</h2>
<div class="outline-text-2" id="text-1">
<p>
ウェブ・サーバーを開発する時はやっぱり<a href="http://haskell-servant.readthedocs.io/en/stable/">Servant</a>。俺の経験では、どの言語のどのフレームワークでも
開発効率が一番高い。幸い、Purescriptとの統合も容易。
</p>

<p>
このガイドを使うに前もって必要なのは「stack」と「Servant」の経験。
</p>
</div>

<div id="outline-container-org060d06e" class="outline-3">
<h3 id="org060d06e"><span class="section-number-3">1.1</span> プロジェクト設定</h3>
<div class="outline-text-3" id="text-1-1">
<p>
後でPurescriptとのコードシェアがうまくいく様にbackendを三つに分けることを勧める。
それぞれの部分にはちゃんと <code>.cabal</code> または <code>package.yaml</code> を与える。
stack設定はこう：
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #715ab1;">resolver</span>: lts-10.6  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#65298;&#65296;&#65297;&#65304;&#24180;2&#26376;&#29694;&#22312;</span>

<span style="color: #715ab1;">packages</span>:
  - lib      <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Purescript&#12392;&#12471;&#12455;&#12450;&#12375;&#12383;&#12356;&#20840;&#12390;&#12290;Servant&#12398;API&#12479;&#12452;&#12503;&#12418;&#21547;&#12417;&#12390;&#65281;</span>
  - server   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Backend&#12398;&#26412;&#26684;&#30340;&#12467;&#12540;&#12489;&#12290;</span>
  - bridge   <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">`lib`&#12434;&#20351;&#12387;&#12390;Purescript&#12434;&#29983;&#12415;&#20986;&#12375;&#12390;&#12367;&#12428;&#12427;&#12467;&#12540;&#12489;&#12290;</span>

<span style="color: #715ab1;">extra-deps</span>:
  - servant-0.12.1
  - servant-server-0.12
  - servant-foreign-0.10.2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdef4f29" class="outline-3">
<h3 id="orgdef4f29"><span class="section-number-3">1.2</span> Purescriptとのコードシェア</h3>
<div class="outline-text-3" id="text-1-2">
<p>
二つのlibrariesが助けてくれる：
</p>

<ul class="org-ul">
<li><code>purescript-bridge</code>: 指摘したHaskellタイプと一致するPurescriptを生み出す。</li>
<li><code>servant-purescript</code>: BackendのJSON endpointsが問えるPurescriptを生み出す。</li>
</ul>

<p>
どうやら <code>servant-purescript</code> はJSON endpointsでしか使えん様で、本サイトの <code>Common</code>
module にはこういうのがある：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span> <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"posts"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">JSON</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"blog"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Capture</span> <span style="color: #2d9574;">"post"</span> <span style="color: #ba2f59; font-weight: bold;">Text</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"assets"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"webfonts"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Purescriptとシェアしたいのは <code>JsonAPI</code> だけ。で、 <code>bridge</code> のプログラムには：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163;">{-# LANGUAGE DataKinds, FlexibleContexts #-}</span>

<span style="color: #3a81c3; font-weight: bold;">module</span> <span style="color: #ba2f59; font-weight: bold;">Main</span> <span style="color: #3a81c3; font-weight: bold;">where</span>

<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Common</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Blog</span>, <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Language.PureScript.Bridge</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.PureScript</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Time.Types</span>

<span style="color: #da8b55;">-- | Purescript&#12395;&#12375;&#12383;&#12356;&#33258;&#20998;&#12398;Haskell&#12479;&#12452;&#12503;&#12290;&#26032;&#12375;&#12356;Purescript&#12364;&#20986;&#12427;&#12290;</span>
<span style="color: #6c3163; font-weight: bold;">types</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">SumType</span> '<span style="color: #ba2f59; font-weight: bold;">Haskell</span><span style="color: #3a81c3;">]</span>
<span style="color: #6c3163; font-weight: bold;">types</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3;">[</span> mkSumType <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">]</span>

<span style="color: #da8b55;">-- | &#33258;&#20316;&#12300;bridge&#12301;&#12290;&#24418;&#12398;&#20840;&#12367;&#21516;&#12376;Haskell&#12392;Purescript&#12398;&#12479;&#12452;&#12503;&#12434;&#32331;&#12370;&#12383;&#12356;&#12392;&#24847;&#21619;&#12377;&#12427;&#12290;</span>
<span style="color: #da8b55;">-- &#26032;&#12375;&#12356;&#12467;&#12540;&#12489;&#12399;&#20986;&#12394;&#12356;&#12290;&#12383;&#12384;JSON decoding&#12398;&#38555;&#12395;&#12384;&#12369;&#20351;&#12431;&#12428;&#12427;&#12290;</span>
<span style="color: #6c3163; font-weight: bold;">monthBridge</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">BridgePart</span>
<span style="color: #6c3163; font-weight: bold;">monthBridge</span> <span style="color: #715ab1;">=</span> typeName <span style="color: #715ab1;">^==</span> <span style="color: #2d9574;">"Month"</span> <span style="color: #715ab1;">&gt;&gt;</span> pure psMonth

<span style="color: #6c3163; font-weight: bold;">psMonth</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">PSType</span>
<span style="color: #6c3163; font-weight: bold;">psMonth</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">TypeInfo</span> <span style="color: #3a81c3;">{</span> _typePackage    <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"purescript-datetime"</span>
                   , _typeModule     <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"Data.Date"</span>
                   , _typeName       <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"Month"</span>
                   , _typeParameters <span style="color: #715ab1;">=</span> <span style="color: #6c3163; font-weight: bold;">[]</span> <span style="color: #3a81c3;">}</span>

<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">IO</span> <span style="color: #3a81c3; font-weight: bold;">()</span>
<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  writePSTypes <span style="color: #2d9574;">"site/src"</span> <span style="color: #3a81c3;">(</span>buildBridge <span style="color: #715ab1;">$</span> defaultBridge <span style="color: #715ab1;">&lt;|&gt;</span> monthBridge<span style="color: #3a81c3;">)</span> types
  writeAPIModule <span style="color: #2d9574;">"site/src"</span> defaultBridgeProxy <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
<code>stack exec -- bridge</code> を使ってみると、 <code>site/src</code> に新しいPurescriptコードが現れる。
下記の「Halogen」の所にこのコードをどう使うかは説明される。
</p>
</div>
</div>
