blog/purescript-jp.org
** Assetsの提供

あるディレクトリーのファイルをそのまま提供するのは簡単：

#+BEGIN_SRC haskell
  import Servant.Utils.StaticFiles (serveDirectoryFileServer)

  type API = ... :<|> "assets" :> Raw

  server :: Server API
  server = ... :<|> serveDirectoryFileServer "assets"
#+END_SRC

これでassets (~.js~ や ~.css~ のファイル)を全部 ~assets/~ に放り込める。

*** 自動圧縮

ちょっとコードを足すだけでサーバーから出されるAssetsの重さを数倍軽くしてくれる[[https://hackage.haskell.org/package/wai-extra][wai-extra]]：

#+BEGIN_SRC haskell
  import Network.Wai.Middleware.Gzip

  app :: Application
  app = gzip (def { gzipFiles = GzipCompress }) $ serve (Proxy :: Proxy API) server
  -- 元はこんな感じ：
  --   app = serve (Proxy :: Proxy API) server
#+END_SRC

** 無HTML

PurescriptがUIを管理するおかげでHTMLファイルをコミットする必要は実はない。
~index.html~ さえbackendが出してくれる：

#+BEGIN_SRC haskell
  import Lucid
  import Servant.HTML.Lucid

  -- | この最後の`Get`がサイトの本（`/`）に一致する。
  type API = ... :<|> Get '[HTML] (Html ())

  index :: Html ()
  index = html_ $ head_ h *> body_ (script_ [src_ "assets/app.js"] ("" :: Text))
    where h = do
            title_ "fosskers.ca"
            link_ [ rel_ "stylesheet", href_ "assets/fosskers.css" ]

  server :: Server API
  server = ... :<|> pure index
#+END_SRC

* Purescript

** 最初の設定

[[https://www.npmjs.com/][npm]]をインストールしてから進む事。

*** ツール

もっとも扱いやすいPurescript開発環境を築くにはちょっと ~npm~ を利用しないと。
これで ~package.json~ が生まれる：

#+BEGIN_SRC bash
  npm init
#+END_SRC

次はツールをインストール。普段はディストロのpackage manager意外のを使うのは
あまり気に入らんけど、この場合は心配ない。次のコマンドで必要のツールが全部
プロジェクト・ディレクトリー（ ~node-modules/~ の中）だけにインストールされる：

#+BEGIN_SRC bash
  npm install purescript pulp psc-package pscid purescript-psa uglify-js --save-dev
#+END_SRC

- ~purescript~: コンパイラ
- ~pulp~: ~cabal~ みたいなbuild tool
- ~psc-package~: Purescript librariesのpackage manager
- ~pscid~: ~stack build --file-watch~ みたいなコンパイラ・デーモン
- ~purescript-psa~: ~pulp~ に使われてより解りやすいコンパイル・エラーを出す
- ~uglify-js~: Javascriptの圧縮のため

上のコマンドで ~package.json~ にもこのツールの名前が現れる。実際に使うには
~package.json~ にこれを：

#+BEGIN_SRC js
  ...
  "scripts": {
      "pulp": "pulp --psc-package",
      "pscid": "pscid",
      "psc": "psc-package",
      "uglify": "uglifyjs"
  },
  ...
#+END_SRC

*** Purescriptパッケージ

上で開発に必要なツールだけがインストールされた。Purescriptのプロジェク設定やコードらしきファイルが
まだない。出そう：

#+BEGIN_SRC bash
  npm run pulp init
#+END_SRC

これで作られるのは：

- ~psc-package.json~: Library Dependenciesを示す所
- ~src/Main.purs~
- ~test/Main.purs~

[[https://pursuit.purescript.org/][Pursuit]]ではありのPurescript Librariesを調べたりできる。インストールするのも楽：

#+BEGIN_SRC bash
  # `purescript-halogen`というパッケージをインストールする。
  # 注意：`purescript-`の部分を除く事。
  npm run psc -- install halogen
#+END_SRC

ダウンロードされるバージョンは ~psc-package.json~ に設定される[[https://github.com/purescript/package-sets][psc・パッケージ・セット]]のバージョンによって違ってくる。
ダウンロードが成功したら ~halogen~ の名前がdependencyとして ~psc-package.json~ に現れる。

*** Spacemacsでの使用

そのまま[[http://spacemacs.org/layers/+lang/purescript/README.html][PureScript Layer]]を使おう。 ~npm~ でインストールしたツールもちゃんと見つかる様に
こう設定しよう：

#+BEGIN_SRC lisp
  (purescript :variables psc-ide-use-npm-bin t)
#+END_SRC

下を ~dotspacemacs/user-config~ にも追加する必要があるみたい：

#+BEGIN_SRC lisp
  (add-hook 'purescript-mode-hook 'flycheck-mode)
#+END_SRC

便利なKeybindings:

| キー          | 結果                           |
|---------------+--------------------------------|
| ~SPC m m s~   | ~pscid~ 発動                   |
| ~SPC m m i a~ | ~point~ にある関数を自動インポート |

