blog/purescript-jp.html

<div id="outline-container-orgec28b74" class="outline-3">
<h3 id="orgec28b74"><span class="section-number-3">1.3</span> Assetsの提供</h3>
<div class="outline-text-3" id="text-1-3">
<p>
あるディレクトリーのファイルをそのまま提供するのは簡単：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.Utils.StaticFiles</span> <span style="color: #3a81c3;">(</span>serveDirectoryFileServer<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"assets"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>

<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Server</span> <span style="color: #ba2f59; font-weight: bold;">API</span>
<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> serveDirectoryFileServer <span style="color: #2d9574;">"assets"</span>
</pre>
</div>

<p>
これでassets (<code>.js</code> や <code>.css</code> のファイル)を全部 <code>assets/</code> に放り込める。
</p>
</div>

<div id="outline-container-orgdf30af4" class="outline-4">
<h4 id="orgdf30af4"><span class="section-number-4">1.3.1</span> 自動圧縮</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
ちょっとコードを足すだけでサーバーから出されるAssetsの重さを数倍軽くしてくれる<a href="https://hackage.haskell.org/package/wai-extra">wai-extra</a>：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Network.Wai.Middleware.Gzip</span>

<span style="color: #6c3163; font-weight: bold;">app</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Application</span>
<span style="color: #6c3163; font-weight: bold;">app</span> <span style="color: #715ab1;">=</span> gzip <span style="color: #3a81c3;">(</span>def <span style="color: #6c3163;">{</span> gzipFiles <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">GzipCompress</span> <span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">$</span> serve <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">API</span><span style="color: #3a81c3;">)</span> server
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#20803;&#12399;&#12371;&#12435;&#12394;&#24863;&#12376;&#65306;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">--   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">app = serve (Proxy :: Proxy API) server</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org267d43a" class="outline-3">
<h3 id="org267d43a"><span class="section-number-3">1.4</span> 無HTML</h3>
<div class="outline-text-3" id="text-1-4">
<p>
PurescriptがUIを管理するおかげでHTMLファイルをコミットする必要は実はない。
<code>index.html</code> さえbackendが出してくれる：
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Lucid</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.HTML.Lucid</span>

<span style="color: #da8b55;">-- | &#12371;&#12398;&#26368;&#24460;&#12398;`Get`&#12364;&#12469;&#12452;&#12488;&#12398;&#26412;&#65288;`/`&#65289;&#12395;&#19968;&#33268;&#12377;&#12427;&#12290;</span>
<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">index</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #3a81c3; font-weight: bold;">()</span>
<span style="color: #6c3163; font-weight: bold;">index</span> <span style="color: #715ab1;">=</span> html_ <span style="color: #715ab1;">$</span> head_ h <span style="color: #715ab1;">*&gt;</span> body_ <span style="color: #3a81c3;">(</span>script_ <span style="color: #6c3163;">[</span>src_ <span style="color: #2d9574;">"assets/app.js"</span><span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">""</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Text</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
  <span style="color: #3a81c3; font-weight: bold;">where</span> h <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
          title_ <span style="color: #2d9574;">"fosskers.ca"</span>
          link_ <span style="color: #3a81c3;">[</span> rel_ <span style="color: #2d9574;">"stylesheet"</span>, href_ <span style="color: #2d9574;">"assets/fosskers.css"</span> <span style="color: #3a81c3;">]</span>

<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Server</span> <span style="color: #ba2f59; font-weight: bold;">API</span>
<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> pure index
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org70f1af4" class="outline-2">
<h2 id="org70f1af4"><span class="section-number-2">2</span> Purescript</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org342599c" class="outline-3">
<h3 id="org342599c"><span class="section-number-3">2.1</span> 最初の設定</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://www.npmjs.com/">npm</a>をインストールしてから進む事。
</p>
</div>

<div id="outline-container-org00cfae1" class="outline-4">
<h4 id="org00cfae1"><span class="section-number-4">2.1.1</span> ツール</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
もっとも扱いやすいPurescript開発環境を築くにはちょっと <code>npm</code> を利用しないと。
これで <code>package.json</code> が生まれる：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm init
</pre>
</div>

<p>
次はツールをインストール。普段はディストロのpackage manager意外のを使うのは
あまり気に入らんけど、この場合は心配ない。次のコマンドで必要のツールが全部
プロジェクト・ディレクトリー（ <code>node-modules/</code> の中）だけにインストールされる：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install purescript pulp psc-package pscid purescript-psa uglify-js --save-dev
</pre>
</div>

<ul class="org-ul">
<li><code>purescript</code>: コンパイラ</li>
<li><code>pulp</code>: <code>cabal</code> みたいなbuild tool</li>
<li><code>psc-package</code>: Purescript librariesのpackage manager</li>
<li><code>pscid</code>: <code>stack build --file-watch</code> みたいなコンパイラ・デーモン</li>
<li><code>purescript-psa</code>: <code>pulp</code> に使われてより解りやすいコンパイル・エラーを出す</li>
<li><code>uglify-js</code>: Javascriptの圧縮のため</li>
</ul>

<p>
上のコマンドで <code>package.json</code> にもこのツールの名前が現れる。実際に使うには
<code>package.json</code> にこれを：
</p>

<div class="org-src-container">
<pre class="src src-js">...
<span style="color: #2d9574;">"scripts"</span>: <span style="color: #3a81c3;">{</span>
    <span style="color: #2d9574;">"pulp"</span>: <span style="color: #2d9574;">"pulp --psc-package"</span>,
    <span style="color: #2d9574;">"pscid"</span>: <span style="color: #2d9574;">"pscid"</span>,
    <span style="color: #2d9574;">"psc"</span>: <span style="color: #2d9574;">"psc-package"</span>,
    <span style="color: #2d9574;">"uglify"</span>: <span style="color: #2d9574;">"uglifyjs"</span>
<span style="color: #3a81c3;">}</span>,
...
</pre>
</div>
</div>
</div>

<div id="outline-container-org696a852" class="outline-4">
<h4 id="org696a852"><span class="section-number-4">2.1.2</span> Purescriptパッケージ</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
上で開発に必要なツールだけがインストールされた。Purescriptのプロジェク設定やコードらしきファイルが
まだない。出そう：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp init
</pre>
</div>

<p>
これで作られるのは：
</p>

<ul class="org-ul">
<li><code>psc-package.json</code>: Library Dependenciesを示す所</li>
<li><code>src/Main.purs</code></li>
<li><code>test/Main.purs</code></li>
</ul>

<p>
<a href="https://pursuit.purescript.org/">Pursuit</a>ではありのPurescript Librariesを調べたりできる。インストールするのも楽：
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">`purescript-halogen`&#12392;&#12356;&#12358;&#12497;&#12483;&#12465;&#12540;&#12472;&#12434;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12377;&#12427;&#12290;</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#27880;&#24847;&#65306;`purescript-`&#12398;&#37096;&#20998;&#12434;&#38500;&#12367;&#20107;&#12290;</span>
npm run psc -- install halogen
</pre>
</div>

<p>
ダウンロードされるバージョンは <code>psc-package.json</code> に設定される<a href="https://github.com/purescript/package-sets">psc・パッケージ・セット</a>のバージョンによって違ってくる。
ダウンロードが成功したら <code>halogen</code> の名前がdependencyとして <code>psc-package.json</code> に現れる。
</p>
</div>
</div>

<div id="outline-container-orgbfa8b9e" class="outline-4">
<h4 id="orgbfa8b9e"><span class="section-number-4">2.1.3</span> Spacemacsでの使用</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
そのまま<a href="http://spacemacs.org/layers/+lang/purescript/README.html">PureScript Layer</a>を使おう。 <code>npm</code> でインストールしたツールもちゃんと見つかる様に
こう設定しよう：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>purescript <span style="color: #3a81c3;">:variables</span> psc-ide-use-npm-bin t<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
下を <code>dotspacemacs/user-config</code> にも追加する必要があるみたい：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>add-hook 'purescript-mode-hook 'flycheck-mode<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
便利なKeybindings:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">キー</th>
<th scope="col" class="org-left">結果</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC m m s</code></td>
<td class="org-left"><code>pscid</code> 発動</td>
</tr>

<tr>
<td class="org-left"><code>SPC m m i a</code></td>
<td class="org-left"><code>point</code> にある関数を自動インポート</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
