blog/purescript-jp.org
** 便利なコマンド

~package.json~ にあるツールを全部（再）ダウンロード：

#+BEGIN_SRC bash
  npm install
#+END_SRC

~psc-package.json~ にあるlibrary dependenciesを全部（再）ダウンロード：

#+BEGIN_SRC bash
  npm run psc -- update
#+END_SRC

Librariesもプロジェクト・コードも全部コンパイル：

#+BEGIN_SRC bash
  npm run pulp build
#+END_SRC

必要なコードだけJavascriptに変える（いわゆる「dead code elimination」）：

#+BEGIN_SRC bash
  npm run pulp -- build --to app.js
#+END_SRC

コンパイラ・デーモンを発動：

#+BEGIN_SRC bash
  npm run pscid
#+END_SRC

テストの確認：

#+BEGIN_SRC bash
  npm run pulp test
#+END_SRC

~pulp build~ で作られたJavascriptを更に圧縮：

#+BEGIN_SRC bash
  npm run uglify -- app.js --output min.js --compress --mangle
#+END_SRC

コードの長さは半分ぐらい減る。

** Halogen

本格的に開発を始める前にHalogenの[[https://github.com/slamdata/purescript-halogen/tree/master/docs][公式ガイド]]（英語）を全部読んだ。
内容を理解したところで開発に必要な知識の9割ぐらい取って、残りは[[https://github.com/purescript/documentation/blob/master/language/Differences-from-Haskell.md][HaskellとPurescriptの区別]]を調べたり
試行錯誤したりして解った。発見したことは下記で。

*** 無駄なレンダリングの回避

~eval~ の関数の中で ~H.put~ と ~H.modify~ が使われる度にそのコンポーネントが
再レンダリングされる。下のコードを使えばstateが本当に変わる時にだけ再レンダリング
が行われる：

#+BEGIN_SRC purescript
  -- | 変わった限りStateをアップデート。
  update :: forall s a m. MonadState s m => Eq a => Lens' s a -> a -> m Unit
  update l a = do
    curr <- gets (_ ^. l)
    unless (a == curr) $ modify (_ # l .~ a)
#+END_SRC

利用の例：

#+BEGIN_SRC purescript
  eval = case _ do
    NewKeywords kws next -> update (prop (SProxy :: SProxy "keywords")) kws *> pure next
    ...  -- more cases here
#+END_SRC

~prop~ の説明は[[https://pursuit.purescript.org/packages/purescript-profunctor-lenses/3.8.0/docs/Data.Lens.Record#v:prop][こちら]]。

