blog/purescript-jp.html

<div id="outline-container-org3f27c2c" class="outline-3">
<h3 id="org3f27c2c"><span class="section-number-3">2.2</span> 便利なコマンド</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>package.json</code> にあるツールを全部（再）ダウンロード：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install
</pre>
</div>

<p>
<code>psc-package.json</code> にあるlibrary dependenciesを全部（再）ダウンロード：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run psc -- update
</pre>
</div>

<p>
Librariesもプロジェクト・コードも全部コンパイル：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp build
</pre>
</div>

<p>
必要なコードだけJavascriptに変える（いわゆる「dead code elimination」）：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp -- build --to app.js
</pre>
</div>

<p>
コンパイラ・デーモンを発動：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pscid
</pre>
</div>

<p>
テストの確認：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp test
</pre>
</div>

<p>
<code>pulp build</code> で作られたJavascriptを更に圧縮：
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run uglify -- app.js --output min.js --compress --mangle
</pre>
</div>

<p>
コードの長さは半分ぐらい減る。
</p>
</div>
</div>

<div id="outline-container-org5764b62" class="outline-3">
<h3 id="org5764b62"><span class="section-number-3">2.3</span> Halogen</h3>
<div class="outline-text-3" id="text-2-3">
<p>
本格的に開発を始める前にHalogenの<a href="https://github.com/slamdata/purescript-halogen/tree/master/docs">公式ガイド</a>（英語）を全部読んだ。
内容を理解したところで開発に必要な知識の9割ぐらい取って、残りは<a href="https://github.com/purescript/documentation/blob/master/language/Differences-from-Haskell.md">HaskellとPurescriptの区別</a>を調べたり
試行錯誤したりして解った。発見したことは下記で。
</p>
</div>

<div id="outline-container-org64c95b7" class="outline-4">
<h4 id="org64c95b7"><span class="section-number-4">2.3.1</span> 無駄なレンダリングの回避</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
<code>eval</code> の関数の中で <code>H.put</code> と <code>H.modify</code> が使われる度にそのコンポーネントが
再レンダリングされる。下のコードを使えばstateが本当に変わる時にだけ再レンダリング
が行われる：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #da8b55;">-- | &#22793;&#12431;&#12387;&#12383;&#38480;&#12426;State&#12434;&#12450;&#12483;&#12503;&#12487;&#12540;&#12488;&#12290;</span>
<span style="color: #6c3163; font-weight: bold;">update</span> <span style="color: #715ab1;">::</span> forall s a m<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">MonadState</span> s m <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Eq</span> a <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Lens'</span> s a <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> m <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">update</span> l a <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  curr <span style="color: #715ab1;">&lt;-</span> gets <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">^.</span> l<span style="color: #3a81c3;">)</span>
  unless <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">==</span> curr<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">$</span> modify <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">#</span> l <span style="color: #715ab1;">.~</span> a<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
利用の例：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">case</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  <span style="color: #ba2f59; font-weight: bold;">NewKeywords</span> kws next <span style="color: #715ab1;">-&gt;</span> update <span style="color: #3a81c3;">(</span>prop <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">SProxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SProxy</span> <span style="color: #2d9574;">"keywords"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> kws <span style="color: #715ab1;">*&gt;</span> pure next
  <span style="color: #715ab1;">...</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">more cases here</span>
</pre>
</div>

<p>
<code>prop</code> の説明は<a href="https://pursuit.purescript.org/packages/purescript-profunctor-lenses/3.8.0/docs/Data.Lens.Record#v:prop">こちら</a>。
</p>
</div>
</div>
