blog/purescript-jp.org
*** ~servant-purescript~ が出したタイプや関数の扱い

~type JsonAPI = "posts" :> Get '[JSON] [Blog]~ から ~servant-purescript~ はこれを吐き出す：

#+BEGIN_SRC purescript
  getPosts :: forall eff m.
              MonadAsk (SPSettings_ SPParams_) m =>
              MonadError AjaxError m =>
              MonadAff ( ajax :: AJAX | eff ) m
              => m (Array Blog)
#+END_SRC

普段、コンポーネントの関数のEffect Monad Parameterは ~m~ で平気だけど、 ~getPosts~
を使うとすぐ ~MonadAsk~ なんじゃらかんじゃらが広がってしまう。長くて醜いtype signaturesと
何回も同じインポートを繰り返すのを避けるために ~Types.purs~ にはこれを入れた：

#+BEGIN_SRC purescript
  type Effects eff = ReaderT (SPSettings_ SPParams_)
                     (ExceptT AjaxError (Aff (ajax :: AJAX, console :: CONSOLE, dom :: DOM | eff)))

  runEffects :: forall eff. Effects eff ~> Aff (ajax :: AJAX, console :: CONSOLE, dom :: DOM | eff)
  runEffects eff = runExceptT (runReaderT eff settings) >>= either (\e -> log (errorToString e) *> empty) pure

  settings :: SPSettings_ SPParams_
  settings = defaultSettings $ SPParams_ { baseURL: "/" }
#+END_SRC

そして関数たちのsignaturesはこう簡単に：

#+BEGIN_SRC purescript
  component :: forall e. H.Component HH.HTML Query Unit Void (Effects e)
#+END_SRC

~main~ をちょっとだけ ~hoist~ で支えると全部無事にコンパイルするはず：

#+BEGIN_SRC purescript
  import Halogen.Aff as HA
  import Halogen.Component as HC

  main :: Eff (HA.HalogenEffects (ajax :: AJAX, console :: CONSOLE)) Unit
  main = HA.runHalogenAff do
    body <- HA.awaitBody
    runUI (HC.hoist runEffects Page.component) unit body
#+END_SRC

*** Effectのあるコンポーネント発動

サーバー等から情報がないと発動できないコンポーネントも時々ある。こういう場合、普通の
~H.component~ （または ~H.parentComponent~ ）の代わりに ~H.lifecycleComponent~
が必要になってくる。

#+BEGIN_SRC purescript
  data Query a = ... | Initialize a

  -- `lifecycleParentComponent`もある。
  component :: forall e. H.Component HH.HTML Query Unit Void (Effects e)
  component = H.lifecycleComponent { initialState: const state
                                   , render
                                   , eval
                                   , receiver: const Nothing
                                   , initializer: Just $ Initialize unit
                                   , finalizer: Nothing }
    where state = ...

  eval :: forall e. Query ~> H.ComponentDSL State Query Void (Effects e)
  eval = case _ of
    ...  -- cases for other query terms.
    Initialize next -> do
      _ <- HQ.fork do
        posts <- H.lift getPosts
        H.modify (_ { posts = posts })
      pure next
#+END_SRC

注意： ~fork~ しないとリクエストが返るまで何も動かん！

