blog/purescript-jp.html

<div id="outline-container-org76cba73" class="outline-4">
<h4 id="org76cba73"><span class="section-number-4">2.3.2</span> <code>servant-purescript</code> が出したタイプや関数の扱い</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<code>type JsonAPI = "posts" :&gt; Get '[JSON] [Blog]</code> から <code>servant-purescript</code> はこれを吐き出す：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">getPosts</span> <span style="color: #715ab1;">::</span> forall eff m<span style="color: #715ab1;">.</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadAsk</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span><span style="color: #3a81c3;">)</span> m <span style="color: #715ab1;">=&gt;</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadError</span> <span style="color: #ba2f59; font-weight: bold;">AjaxError</span> m <span style="color: #715ab1;">=&gt;</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadAff</span> <span style="color: #3a81c3;">(</span> ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span> <span style="color: #715ab1;">|</span> eff <span style="color: #3a81c3;">)</span> m
            <span style="color: #715ab1;">=&gt;</span> m <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array</span> <span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
普段、コンポーネントの関数のEffect Monad Parameterは <code>m</code> で平気だけど、 <code>getPosts</code>
を使うとすぐ <code>MonadAsk</code> なんじゃらかんじゃらが広がってしまう。長くて醜いtype signaturesと
何回も同じインポートを繰り返すのを避けるために <code>Types.purs</code> にはこれを入れた：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">Effects</span> eff <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">ReaderT</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span><span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">ExceptT</span> <span style="color: #ba2f59; font-weight: bold;">AjaxError</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Aff</span> <span style="color: #2d9574;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span>, dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> eff<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">runEffects</span> <span style="color: #715ab1;">::</span> forall eff<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">Effects</span> eff <span style="color: #715ab1;">~&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Aff</span> <span style="color: #3a81c3;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span>, dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> eff<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">runEffects</span> eff <span style="color: #715ab1;">=</span> runExceptT <span style="color: #3a81c3;">(</span>runReaderT eff settings<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">&gt;&gt;=</span> either <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>e <span style="color: #715ab1;">-&gt;</span> log <span style="color: #6c3163;">(</span>errorToString e<span style="color: #6c3163;">)</span> <span style="color: #715ab1;">*&gt;</span> empty<span style="color: #3a81c3;">)</span> pure

<span style="color: #6c3163; font-weight: bold;">settings</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span>
<span style="color: #6c3163; font-weight: bold;">settings</span> <span style="color: #715ab1;">=</span> defaultSettings <span style="color: #715ab1;">$</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span> <span style="color: #3a81c3;">{</span> baseURL<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #2d9574;">"/"</span> <span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
そして関数たちのsignaturesはこう簡単に：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">H.Component</span> <span style="color: #ba2f59; font-weight: bold;">HH.HTML</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
<code>main</code> をちょっとだけ <code>hoist</code> で支えると全部無事にコンパイルするはず：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Halogen.Aff</span> <span style="color: #3a81c3; font-weight: bold;">as</span> <span style="color: #ba2f59; font-weight: bold;">HA</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Halogen.Component</span> <span style="color: #3a81c3; font-weight: bold;">as</span> <span style="color: #ba2f59; font-weight: bold;">HC</span>

<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Eff</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HA.HalogenEffects</span> <span style="color: #6c3163;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">HA</span><span style="color: #715ab1;">.</span>runHalogenAff <span style="color: #3a81c3; font-weight: bold;">do</span>
  body <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">HA</span><span style="color: #715ab1;">.</span>awaitBody
  runUI <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HC</span><span style="color: #715ab1;">.</span>hoist runEffects <span style="color: #ba2f59; font-weight: bold;">Page</span><span style="color: #715ab1;">.</span>component<span style="color: #3a81c3;">)</span> unit body
</pre>
</div>
</div>
</div>

<div id="outline-container-org15cddac" class="outline-4">
<h4 id="org15cddac"><span class="section-number-4">2.3.3</span> Effectのあるコンポーネント発動</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
サーバー等から情報がないと発動できないコンポーネントも時々ある。こういう場合、普通の
<code>H.component</code> （または <code>H.parentComponent</code> ）の代わりに <code>H.lifecycleComponent</code>
が必要になってくる。
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> a <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Initialize</span> a

<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">`lifecycleParentComponent`&#12418;&#12354;&#12427;&#12290;</span>
<span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">H.Component</span> <span style="color: #ba2f59; font-weight: bold;">HH.HTML</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>lifecycleComponent <span style="color: #3a81c3;">{</span> initialState<span style="color: #ba2f59; font-weight: bold;">:</span> const state
                                 , render
                                 , eval
                                 , receiver<span style="color: #ba2f59; font-weight: bold;">:</span> const <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
                                 , initializer<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #ba2f59; font-weight: bold;">Just</span> <span style="color: #715ab1;">$</span> <span style="color: #ba2f59; font-weight: bold;">Initialize</span> unit
                                 , finalizer<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span> <span style="color: #3a81c3;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">where</span> state <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span>

<span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #715ab1;">~&gt;</span> <span style="color: #ba2f59; font-weight: bold;">H.ComponentDSL</span> <span style="color: #ba2f59; font-weight: bold;">State</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">case</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">of</span>
  <span style="color: #715ab1;">...</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">cases for other query terms.</span>
  <span style="color: #ba2f59; font-weight: bold;">Initialize</span> next <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
    <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">HQ</span><span style="color: #715ab1;">.</span>fork <span style="color: #3a81c3; font-weight: bold;">do</span>
      posts <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>lift getPosts
      <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>modify <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #6c3163;">{</span> posts <span style="color: #715ab1;">=</span> posts <span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
    pure next
</pre>
</div>

<p>
注意： <code>fork</code> しないとリクエストが返るまで何も動かん！
</p>
</div>
</div>
