blog/purescript-jp.org
*** HTMLの要求と注入

訳あって本サイトのブログのHTMLはruntimeにしか存在しない。記事を選んでクリックしたら
一つのXHRだけがされて返事のHTMLはそのままページに注入される。これを達成するには
三つにlibraryが必要だった： ~affjax~ ・ ~domparser~ ・ ~dom-classy~

下のコードでサーバーへのHTML要求ができる：

#+BEGIN_SRC purescript
  -- | サーバーへHTML要求。
  xhr :: forall e. String -> Aff ( ajax :: AJAX, dom :: DOM | e ) (Array Node)
  xhr p = do
    res <- get $ "/blog/" <> p
    liftEff do
      parser <- newDOMParser
      let doc = parseHTMLFromString res.response parser
      body <- lastChild doc >>= (map join <<< traverse lastChild)
      maybe (pure []) children body

  replaceChildren :: forall e n m. IsNode n => IsNode m => n -> Array m -> Eff ( dom :: DOM | e ) Unit
  replaceChildren el news = removeChildren el *> traverse_ (\n -> appendChild n el) news

  removeChildren :: forall n e. IsNode n => n -> Eff ( dom :: DOM | e ) Unit
  removeChildren el = children el >>= traverse_ (\n -> removeChild n el)

  children :: forall n e. IsNode n => n -> Eff ( dom :: DOM | e ) (Array Node)
  children el = do
    kids <- childNodes el
    len  <- length kids
    let ixs = range 0 (len - 1)
    catMaybes <$> traverse (\i -> item i kids) ixs
#+END_SRC

~children~ などで ~halogen~ の管轄外で直接DOMを弄れる。まずはプレースホルダーの ~<div>~ を：

#+BEGIN_SRC purescript
  post :: forall c q. HH.HTML c q
  post = HH.div [ HP.ref (H.RefLabel "blogpost") ] []
#+END_SRC

もらったHTMLは後でここに入る。 ~post~ 自体は勿論いつもの ~render~ 関数のどこかに入る。
大事なのは ~RefLabel~ 。実際内容を注ぎ込みたいと ~eval~ で：

#+BEGIN_SRC purescript
  eval :: forall e. Query ~> H.ComponentDSL State Query Void (Effects e)
  eval = case _ of
    ...  -- other cases
    Selected s next -> do
      curr <- H.gets _.selected
      unless (s == curr) $ do
        H.modify (_ { selected = s })
        htmls <- H.getHTMLElementRef (H.RefLabel "blogpost")
        traverse_ (\el -> liftAff (xhr s) >>= liftEff <<< replaceChildren el) htmls
      pure next
#+END_SRC
