blog/purescript-jp.html

<div id="outline-container-orga245af1" class="outline-4">
<h4 id="orga245af1"><span class="section-number-4">2.3.4</span> HTMLの要求と注入</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
訳あって本サイトのブログのHTMLはruntimeにしか存在しない。記事を選んでクリックしたら
一つのXHRだけがされて返事のHTMLはそのままページに注入される。これを達成するには
三つにlibraryが必要だった： <code>affjax</code> ・ <code>domparser</code> ・ <code>dom-classy</code>
</p>

<p>
下のコードでサーバーへのHTML要求ができる：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #da8b55;">-- | &#12469;&#12540;&#12496;&#12540;&#12408;HTML&#35201;&#27714;&#12290;</span>
<span style="color: #6c3163; font-weight: bold;">xhr</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">String</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Aff</span> <span style="color: #3a81c3;">(</span> ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> e <span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array</span> <span style="color: #ba2f59; font-weight: bold;">Node</span><span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">xhr</span> p <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  res <span style="color: #715ab1;">&lt;-</span> get <span style="color: #715ab1;">$</span> <span style="color: #2d9574;">"/blog/"</span> <span style="color: #715ab1;">&lt;&gt;</span> p
  liftEff <span style="color: #3a81c3; font-weight: bold;">do</span>
    parser <span style="color: #715ab1;">&lt;-</span> newDOMParser
    <span style="color: #3a81c3; font-weight: bold;">let</span> doc <span style="color: #715ab1;">=</span> parseHTMLFromString res<span style="color: #715ab1;">.</span>response parser
    body <span style="color: #715ab1;">&lt;-</span> lastChild doc <span style="color: #715ab1;">&gt;&gt;=</span> <span style="color: #3a81c3;">(</span>map join <span style="color: #715ab1;">&lt;&lt;&lt;</span> traverse lastChild<span style="color: #3a81c3;">)</span>
    maybe <span style="color: #3a81c3;">(</span>pure <span style="color: #6c3163; font-weight: bold;">[]</span><span style="color: #3a81c3;">)</span> children body

<span style="color: #6c3163; font-weight: bold;">replaceChildren</span> <span style="color: #715ab1;">::</span> forall e n m<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">IsNode</span> n <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">IsNode</span> m <span style="color: #715ab1;">=&gt;</span> n <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Array</span> m <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Eff</span> <span style="color: #3a81c3;">(</span> dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> e <span style="color: #3a81c3;">)</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">replaceChildren</span> el news <span style="color: #715ab1;">=</span> removeChildren el <span style="color: #715ab1;">*&gt;</span> traverse_ <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>n <span style="color: #715ab1;">-&gt;</span> appendChild n el<span style="color: #3a81c3;">)</span> news

<span style="color: #6c3163; font-weight: bold;">removeChildren</span> <span style="color: #715ab1;">::</span> forall n e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">IsNode</span> n <span style="color: #715ab1;">=&gt;</span> n <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Eff</span> <span style="color: #3a81c3;">(</span> dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> e <span style="color: #3a81c3;">)</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">removeChildren</span> el <span style="color: #715ab1;">=</span> children el <span style="color: #715ab1;">&gt;&gt;=</span> traverse_ <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>n <span style="color: #715ab1;">-&gt;</span> removeChild n el<span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">children</span> <span style="color: #715ab1;">::</span> forall n e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">IsNode</span> n <span style="color: #715ab1;">=&gt;</span> n <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Eff</span> <span style="color: #3a81c3;">(</span> dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> e <span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array</span> <span style="color: #ba2f59; font-weight: bold;">Node</span><span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">children</span> el <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  kids <span style="color: #715ab1;">&lt;-</span> childNodes el
  len  <span style="color: #715ab1;">&lt;-</span> length kids
  <span style="color: #3a81c3; font-weight: bold;">let</span> ixs <span style="color: #715ab1;">=</span> range <span style="color: #4e3163;">0</span> <span style="color: #3a81c3;">(</span>len <span style="color: #715ab1;">-</span> <span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
  catMaybes <span style="color: #715ab1;">&lt;$&gt;</span> traverse <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>i <span style="color: #715ab1;">-&gt;</span> item i kids<span style="color: #3a81c3;">)</span> ixs
</pre>
</div>

<p>
<code>children</code> などで <code>halogen</code> の管轄外で直接DOMを弄れる。まずはプレースホルダーの <code>&lt;div&gt;</code> を：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">post</span> <span style="color: #715ab1;">::</span> forall c q<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">HH.HTML</span> c q
<span style="color: #6c3163; font-weight: bold;">post</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">HH</span><span style="color: #715ab1;">.</span>div <span style="color: #3a81c3;">[</span> <span style="color: #ba2f59; font-weight: bold;">HP</span><span style="color: #715ab1;">.</span>ref <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">H.RefLabel</span> <span style="color: #2d9574;">"blogpost"</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">]</span> <span style="color: #3a81c3; font-weight: bold;">[]</span>
</pre>
</div>

<p>
もらったHTMLは後でここに入る。 <code>post</code> 自体は勿論いつもの <code>render</code> 関数のどこかに入る。
大事なのは <code>RefLabel</code> 。実際内容を注ぎ込みたいと <code>eval</code> で：
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #715ab1;">~&gt;</span> <span style="color: #ba2f59; font-weight: bold;">H.ComponentDSL</span> <span style="color: #ba2f59; font-weight: bold;">State</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">case</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">of</span>
  <span style="color: #715ab1;">...</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">other cases</span>
  <span style="color: #ba2f59; font-weight: bold;">Selected</span> s next <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
    curr <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>gets <span style="color: #3a81c3; font-weight: bold;">_</span><span style="color: #715ab1;">.</span>selected
    unless <span style="color: #3a81c3;">(</span>s <span style="color: #715ab1;">==</span> curr<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">$</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
      <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>modify <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #6c3163;">{</span> selected <span style="color: #715ab1;">=</span> s <span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
      htmls <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>getHTMLElementRef <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">H.RefLabel</span> <span style="color: #2d9574;">"blogpost"</span><span style="color: #3a81c3;">)</span>
      traverse_ <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>el <span style="color: #715ab1;">-&gt;</span> liftAff <span style="color: #6c3163;">(</span>xhr s<span style="color: #6c3163;">)</span> <span style="color: #715ab1;">&gt;&gt;=</span> liftEff <span style="color: #715ab1;">&lt;&lt;&lt;</span> replaceChildren el<span style="color: #3a81c3;">)</span> htmls
    pure next
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-21</p>
<p class="author">Author: Colin</p>
<p class="date">Created: 2018-02-23 Fri 08:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>